Manuals/OpenDM_2Mode_Theory.org
#+TITLE: OpenDM Two Parameter UMAT: C++ Manual
#+AUTHOR: Bryce Mazurowski
#+EMAIL: brycepm2@gmail.com
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage{bpmResearchPaper}
#+LATEX_HEADER: \setlength{\parindent}{0pt}

* Theory
** Problem
*** Solid mechanics: infinitesimal deformation
Strong Form neglecting inertial effects and body forces:
#+begin_src latex
  \begin{equation}
    \diverge \stress = 0 \quad \forall \pos \in \Omega
  \end{equation}
#+end_src
BCs:
#+begin_src latex
  \begin{equation}
    \begin{split}
      \disp &= \bar{\disp} \quad \forall \pos \in \Gamma_d \\
      \stress \dot \vect{n} &= \bar{\traction}
      \quad \forall \pos \in \Gamma_n \\
    \end{split}
  \end{equation}
#+end_src
Strain:
#+begin_src latex
\[
\strain = \frac{1}{2}(\grad \disp + \grad^T \disp)
\]
#+end_src
*** Weak form
Weak Form:
#+begin_src latex
\[
\int_{\Omega} \grad \weight : \stress d\Omega =
\int_{\Gamma_n} \weight \dot \bar{\traction} d\Gamma
\]
#+end_src
*** Material nonlinearity:
Material nonlinearity requires a special solver. Newton-Raphson is the
classical choice. However, as discussed in Section~[[* General comments
about the tangent stiffness matrix]]. The displacement solution becomes incremental
#+begin_src latex
\[
\disp_n = \sum_{j=0}^{n} \Delta \disp
\]
#+end_src
With updates at each NR solve at each load step:
#+begin_src latex
\[
\disp_{n+1} = \disp_n + \Delta \disp_{n+1}
\]
#+end_src
Make weak form a residual:
#+begin_src latex
  \[
  R = 
  \int_{\Gamma_n} \weight \dot \bar{\traction} d\Gamma -
  \int_{\Omega} \grad \weight : \stress d\Omega
  \]
#+end_src
Linearize with Taylor Series:
#+begin_src latex
\[
R (\disp_{n+1}) = R (\disp_{n}) +
\frac{\partial R}{\partial \disp} (\disp_{n})
\delta \disp_{n+1} +
HOT
\]
#+end_src
Progressing from a converged solution, $R(\disp_n) = 0$, dropping
higher order terms
#+begin_src latex
\[
\frac{\partial R}{\partial \disp}(\disp_n) \delta \disp_{n+1} \approx 
R (\disp_{n+1})
\]
#+end_src
The quantity $\disp_{n+1}$ is found iteratively in the Newton-Raphson
scheme. So we solve a given load step $n$ for a number of NR
increments $i$ as:
#+begin_src latex
\[
\frac{\partial R}{\partial \disp} (\disp_n^i) \delta \disp_{n+1}^{i+1} =
R (\disp_{n}^{i})
\]
#+end_src
With our residual, this becomes:
#+begin_src latex
  \[
  \int_{\Omega} \grad \weight : \frac{\partial \stress}{\partial \disp}
  \delta \disp_{n+t}^{i+1} d\Omega =
  \int_{\Gamma_n} \weight \dot \bar{\traction} -
  \int_{\Omega} \grad \weight : \stress (\disp) d\Omega 
  \]
#+end_src
Where stress depends on $\disp_{n}^{i}$ in each term. Once the system
of equations is solved for a give $i$, the displacement is updated. The
residual is then recomputed, and can be used as a convergence check.

The term $\frac{\partial \stress}{\partial \disp}$ is the material
tangent stiffness matrix.
*** TODO Relevant coordinate systems and transformations
- Problem coordinates
- Material coordinates
- Transforming between the two
- Notation for each case
** OpenDM Two Parameter Model
*** Physical motivation
- Damage formulation for woven CMCs (Cite Maire papers)
- Damage parameters represent cracking
  - d1: Aligned with principal direction of mat coords
  - d2: Perpendicular to principal direction of mat coords
**** TODO Add figure
**** TODO Add citation
*** Constitutive behavior
**** Helmholtz free energy

#+begin_src latex
  \[
  \psi = \frac{1}{2 \rho} (\strain^* : \tilde{\vect{C}} : \strain^*)
  \]
#+end_src
Where $\strain^*$ is mechanical strain:
$\strain^* = \strain - \strain^{th}$
**** Stress

Stress is the derivative of the Helmholtz free energy with respect to strain:
#+begin_src latex
  \[
  \stress = \rho \frac{\partial \psi}{\partial \strain} =
  \tilde{\vect{C}} : \strain^*
  \]
#+end_src
**** Material stiffness matrix

The material stiffness tensor is affected by the two damage parameters
and their progression. This relationship depends on the strain and is
calculated as follows:
#+begin_src latex
\[
\tilde{\vect{C}} = (\tilde{\vect{S}})^{-1}
\]
#+end_src
where $\tilde{\vect{S}}$ is the material compliance tensor for a given
strain and history.

The material compliance tensor for OpenDM two parameter model is
calculated as follows:
#+begin_src latex
\[
\tilde{\vect{S}} = \vect{S}^0 + d^1 \vect{H}^1 + d^2 \vect{H}^2
\]
#+end_src
$\vect{S}^0$ is the undamaged material compliance tensor.

$\vect{H}^i$ tensors are constants that modify the material
compliance for each damage component. They are calculated as:
#+begin_src latex
  \[
  \vect{H}^1 =
  \begin{bmatrix}
    h_1^1 S_{11}^0 & 0 & 0 & 0 & 0 & 0 \\
    0 & 0 & 0 & 0 & 0 & 0 \\
    0 & 0 & 0 & 0 & 0 & 0 \\
    0 & 0 & 0 & 0 & 0 & 0 \\
    0 & 0 & 0 & 0 & h_3^1 S_{55}^0 & 0 \\
    0 & 0 & 0 & 0 & 0 & h_2^1 S_{66}^0 
  \end{bmatrix}
  \]
#+end_src
and
#+begin_src latex
  \[
  \vect{H}^2 =
  \begin{bmatrix}
    0 & 0 & 0 & 0 & 0 & 0 \\
    0 & h_1^2 S_{22}^0 & 0 & 0 & 0 & 0 \\
    0 & 0 & 0 & 0 & 0 & 0 \\
    0 & 0 & 0 & h_3^2 S_{44}^0 & 0 & 0 \\
    0 & 0 & 0 & 0 & 0 & 0 \\
    0 & 0 & 0 & 0 & 0 & h_2^2 S_{66}^0 
  \end{bmatrix}
  \]
#+end_src
The quantities $h_i^m$ are mode specific parameters that increase or
decrease the effect of damage has on each mode.

$\vect{H}^1$ brings stiffness changes as a result of Mode I, II, and
III microcracking in the CMC matrix as $d^1$ increases from zero. This
corresponds to microcracks that are growing perpendicular to the
principle material direction.

$\vect{H}^2$ Brings in the same microcracking effects, but for cracks
that are parallel to the principle material direction.

**** Material tangent stiffness matrix

The material tangent stiffness tensor is the derivative of the stress
wrt strain:
#+begin_src latex
  \[
  \vect{C}_{tan} = \frac{\partial \stress}{\partial \strain} = 
  \frac{\partial \tilde{\vect{C}}}{\partial \strain} +
  \tilde{\vect{C}}
  \]
#+end_src
Material nonlinearity is reflected by the fact that the partial
derivative of the material stiffness tensor with respect to strain is
not zero. In the OpenDM model, this nonlinearity is caused by the two
damage parameters $d^1$ and $d^2$

