Manuals/OpenDM_2Mode_Theory.tex
% Created 2024-09-04 Wed 15:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\usepackage{bpmResearchPaper}
\setlength{\parindent}{0pt}
\author{Bryce Mazurowski}
\date{\today}
\title{OpenDM Two Parameter UMAT: C++ Manual}
\hypersetup{
 pdfauthor={Bryce Mazurowski},
 pdftitle={OpenDM Two Parameter UMAT: C++ Manual},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Theory}
\label{sec:orgdf29f96}
\subsection{Problem}
\label{sec:org8530420}
\subsubsection{Solid mechanics: infinitesimal deformation}
\label{sec:org5b776cb}
Strong Form neglecting inertial effects and body forces:
\begin{equation}
  \diverge \stress = 0 \quad \forall \pos \in \Omega
\end{equation}

BCs:
\begin{equation}
  \begin{split}
    \disp &= \bar{\disp} \quad \forall \pos \in \Gamma_d \\
    \stress \dot \vect{n} &= \bar{\traction}
    \quad \forall \pos \in \Gamma_n \\
  \end{split}
\end{equation}

Strain:
\[
\strain = \frac{1}{2}(\grad \disp + \grad^T \disp)
\]

\subsubsection{Weak form}
\label{sec:org3927006}
Weak Form:
\[
\int_{\Omega} \grad \weight : \stress d\Omega =
\int_{\Gamma_n} \weight \dot \bar{\traction} d\Gamma
\]

\subsubsection{Material nonlinearity:}
\label{sec:orgeadafd3}
Material nonlinearity requires a special solver. Newton-Raphson is the
classical choice. However, as discussed in Section\textasciitilde{}\ref{sec:org36dc872}. The displacement solution becomes incremental
\[
\disp_n = \sum_{j=0}^{n} \Delta \disp
\]

With updates at each NR solve at each load step:
\[
\disp_{n+1} = \disp_n + \Delta \disp_{n+1}
\]

Make weak form a residual:
\[
R = 
\int_{\Gamma_n} \weight \dot \bar{\traction} d\Gamma -
\int_{\Omega} \grad \weight : \stress d\Omega
\]

Linearize with Taylor Series:
\[
R (\disp_{n+1}) = R (\disp_{n}) +
\frac{\partial R}{\partial \disp} (\disp_{n})
\delta \disp_{n+1} +
HOT
\]

Progressing from a converged solution, \(R(\disp_n) = 0\), dropping
higher order terms
\[
\frac{\partial R}{\partial \disp}(\disp_n) \delta \disp_{n+1} \approx 
R (\disp_{n+1})
\]

The quantity \(\disp_{n+1}\) is found iteratively in the Newton-Raphson
scheme. So we solve a given load step \(n\) for a number of NR
increments \(i\) as:
\[
\frac{\partial R}{\partial \disp} (\disp_n^i) \delta \disp_{n+1}^{i+1} =
R (\disp_{n}^{i})
\]

With our residual, this becomes:
\[
\int_{\Omega} \grad \weight : \frac{\partial \stress}{\partial \disp}
\delta \disp_{n+t}^{i+1} d\Omega =
\int_{\Gamma_n} \weight \dot \bar{\traction} -
\int_{\Omega} \grad \weight : \stress (\disp) d\Omega 
\]

Where stress depends on \(\disp_{n}^{i}\) in each term. Once the system
of equations is solved for a give \(i\), the displacement is updated. The
residual is then recomputed, and can be used as a convergence check.

The term \(\frac{\partial \stress}{\partial \disp}\) is the material
tangent stiffness matrix.
\subsubsection{{\bfseries\sffamily TODO} Relevant coordinate systems and transformations}
\label{sec:org98c4a7f}
\begin{itemize}
\item Problem coordinates
\item Material coordinates
\item Transforming between the two
\item Notation for each case
\end{itemize}
\subsection{OpenDM Two Parameter Model}
\label{sec:orgc376f26}
\subsubsection{Physical motivation}
\label{sec:orgd3feb51}
\begin{itemize}
\item Damage formulation for woven CMCs (Cite Maire papers)
\item Damage parameters represent cracking
\begin{itemize}
\item d1: Aligned with principal direction of mat coords
\item d2: Perpendicular to principal direction of mat coords
\end{itemize}
\end{itemize}
\begin{enumerate}
\item {\bfseries\sffamily TODO} Add figure
\label{sec:org527de92}
\item {\bfseries\sffamily TODO} Add citation
\label{sec:org10ac20b}
\end{enumerate}
\subsubsection{Constitutive behavior}
\label{sec:org56e2ece}
\begin{enumerate}
\item Helmholtz free energy
\label{sec:org2452ccf}

\[
\psi = \frac{1}{2 \rho} (\strain^* : \tilde{\vect{C}} : \strain^*)
\]

Where \(\strain^*\) is mechanical strain:
\(\strain^* = \strain - \strain^{th}\)
\item Stress
\label{sec:orge0cf328}

Stress is the derivative of the Helmholtz free energy with respect to strain:
\[
\stress = \rho \frac{\partial \psi}{\partial \strain} =
\tilde{\vect{C}} : \strain^*
\]

\item Material stiffness matrix
\label{sec:org5d7b656}

The material stiffness tensor is affected by the two damage parameters
and their progression. This relationship depends on the strain and is
calculated as follows:
\[
\tilde{\vect{C}} = (\tilde{\vect{S}})^{-1}
\]

where \(\tilde{\vect{S}}\) is the material compliance tensor for a given
strain and history.

The material compliance tensor for OpenDM two parameter model is
calculated as follows:
\[
\tilde{\vect{S}} = \vect{S}^0 + d^1 \vect{H}^1 + d^2 \vect{H}^2
\]

\(\vect{S}^0\) is the undamaged material compliance tensor.

\(\vect{H}^i\) tensors are constants that modify the material
compliance for each damage component. They are calculated as:
\[
\vect{H}^1 =
\begin{bmatrix}
  h_1^1 S_{11}^0 & 0 & 0 & 0 & 0 & 0 \\
  0 & 0 & 0 & 0 & 0 & 0 \\
  0 & 0 & 0 & 0 & 0 & 0 \\
  0 & 0 & 0 & 0 & 0 & 0 \\
  0 & 0 & 0 & 0 & h_3^1 S_{55}^0 & 0 \\
  0 & 0 & 0 & 0 & 0 & h_2^1 S_{66}^0 
\end{bmatrix}
\]

and
\[
\vect{H}^2 =
\begin{bmatrix}
  0 & 0 & 0 & 0 & 0 & 0 \\
  0 & h_1^2 S_{22}^0 & 0 & 0 & 0 & 0 \\
  0 & 0 & 0 & 0 & 0 & 0 \\
  0 & 0 & 0 & h_3^2 S_{44}^0 & 0 & 0 \\
  0 & 0 & 0 & 0 & 0 & 0 \\
  0 & 0 & 0 & 0 & 0 & h_2^2 S_{66}^0 
\end{bmatrix}
\]

The quantities \(h_i^m\) are mode specific parameters that increase or
decrease the effect of damage has on each mode.

\(\vect{H}^1\) brings stiffness changes as a result of Mode I, II, and
III microcracking in the CMC matrix as \(d^1\) increases from zero. This
corresponds to microcracks that are growing perpendicular to the
principle material direction.

\(\vect{H}^2\) Brings in the same microcracking effects, but for cracks
that are parallel to the principle material direction.

\item Material tangent stiffness matrix
\label{sec:org8d4e77e}

The material tangent stiffness tensor is the derivative of the stress
wrt strain:
\[
\vect{C}_{tan} = \frac{\partial \stress}{\partial \strain} = 
\frac{\partial \tilde{\vect{C}}}{\partial \strain} +
\tilde{\vect{C}}
\]

Material nonlinearity is reflected by the fact that the partial
derivative of the material stiffness tensor with respect to strain is
not zero. In the OpenDM model, this nonlinearity is caused by the two
damage parameters \(d^1\) and \(d^2\)
