Manuals/OpenDM_2Mode_Theory.org
**** Damage values and evolution

The damage variables evolve based on individual psuedo potentials:
#+begin_src latex
\[
F^i = f(y^i) - d^i
\]
#+end_src
Driving forces $y^i$ are calculated for each damage mode:
#+begin_src latex
  \begin{equation}
    \begin{split}
      y^1 &= \frac{1}{2} (
      \varepsilon_{11} C^0_{1111} \varepsilon_{11} + 
      b_2 \varepsilon_{13} C^0_{1313} \varepsilon_{13} + 
      b_1 \varepsilon_{12} C^0_{1212} \varepsilon_{12} ) \\ 
      y^2 &= \frac{1}{2} (
      \varepsilon_{22} C^0_{2222} \varepsilon_{22} + 
      b_2 \varepsilon_{23} C^0_{2323} \varepsilon_{23} + 
      b_1 \varepsilon_{12} C^0_{1212} \varepsilon_{12} ) \\ 
    \end{split}
  \end{equation}
#+end_src
where $b_i$ are damage specific shear coupling parameters that
increase the amount shear strains drive damage growth.

For convenience, another step is added here:
#+begin_src latex
  \[
  g^i = \frac{\langle \sqrt{y_{max}^i} - \sqrt{y_0^i}\rangle_+}{
  \sqrt{y_c^i}}
  \]
#+end_src
where we have added a history effect in $y_{max}^i$, which 
takes the largest $y^i$ value over time for each mode at the time of calculation
for a given material point.
$\langle \dot \rangle_+$ is the positive
Macaulay bracket.

$y_0^i$ is a model parameter that sets a threshold value of the
driving force to start damage.

$y_c^i$ is a model parameter that changes the celerity of the damage
progression.

The final step is
#+begin_src latex
\[
f(y^i) = d_c^i [1 - \exp^{-(g^i)^{(p^i)}}]
\]
#+end_src
$d_c^i$ sets the maximum value of the damage parameter.

$p^i$ changes the shape of the curve of damage progression.
**** Analytical tangent stiffness matrix

Starting from the equation for stress in Voigt notation,
#+begin_src latex
\[
\sigma_i = \tilde{C}_{ik} \varepsilon_{k},
\]
#+end_src
the analytical tangent stiffness matrix can be calculated.

#+begin_src latex
  \[
  \frac{\partial \sigma_i}{\partial \varepsilon_j} =
  \frac{\partial \tilde{C}_{ik}}{\partial \varepsilon_j} \varepsilon_k +
  \tilde{C}_{ij}
  \]
#+end_src
The difficult part of the above equation is
$\frac{\partial \tilde{c}_{ik}}{\partial \varepsilon_j}$, which is
calculated as
#+begin_src latex
  \[
  \frac{\partial \tilde{C}_{ik}}{\partial \varepsilon_{j}} =
  \frac{\partial \tilde{S}_{ik}^{-1}}{\partial \varepsilon_{j}}.
  \]
#+end_src
The derivative of the inverse of the effective compliance tensor can
be computed if we start from the indentity for the inverse.
#+begin_src latex
  \begin{equation}
    \begin{split}
      \tilde{S}_{ik}^{-1} S_{kl} &= \delta_{il} \\
      \frac{\partial}{\partial \epsilon_{j}} (\tilde{S}_{ik}^{-1} S_{kl}) &= 0_{ilj} \\
      \frac{\partial \tilde{S}_{ik}^{-1}}{\partial \varepsilon_{j}} \tilde{S}_{kl} +
      \tilde{S}_{ik}^{-1} \frac{\partial \tilde{S}_{kl}}{\partial \varepsilon_{j}} &= 0_{ilj} \\
      \frac{\partial \tilde{S}_{ik}^{-1}}{\partial \varepsilon_{j}} \tilde{S}_{kl} &=
      -\tilde{S}_{ik}^{-1} \frac{\partial \tilde{S}_{kl}}{\partial \varepsilon_{j}} \\
      \frac{\partial \tilde{S}_{ik}^{-1}}{\partial \varepsilon_{j}} =
      -\tilde{S}_{ik}^{-1} \frac{\partial \tilde{S}_{km}}{\partial \varepsilon_{j}} \tilde{S}_{ml}^{-1} &=
      -\tilde{C}_{ik} \frac{\partial \tilde{S}_{km}}{\partial \varepsilon_{j}} \tilde{C}_{ml}
    \end{split}
  \end{equation}
#+end_src
This includes the assumption that the compliance tensor is invertible,
but that is a must have in mechanics. The next step is the derivative
of the compliance tensor.
#+begin_src latex
  \[
  \frac{\partial \tilde{S}_{km}}{\partial \varepsilon_j} =
  \frac{\partial}{\partial \varepsilon_j} (S_{km}^{0} + \sum_{n=1}^{2} d^n H^n_{km}) = \sum_{n=1}^2 \frac{\partial d^n}{\partial \varepsilon_j} H_{km}^n
  \]
#+end_src
The derivative for each damage mode can then be calculated
#+begin_src latex
  \[
  \frac{\partial d^n}{\partial \varepsilon_j} =
  \frac{\partial}{\partial \varepsilon_j}
  (d_c^n(1 - \exp^{-(g^n)^{(p^m)}})) =
  \frac{\partial}{\partial \varepsilon_j}(-d_c^n \exp^{-(g^n)^{(p^n)}})
  \]
#+end_src
The only non-constants in this formula is $g^n$. We can use the chain
rule to simplify this.
#+begin_src latex
  \[
  \frac{\partial d^n}{\partial \varepsilon_j} = 
  \frac{\partial d^n}{\partial g^n} \frac{\partial g^n}{\partial \varepsilon_j}
  \]
#+end_src
The derivative with respect to $g^n$ is then
#+begin_src latex
\[
\frac{\partial d^n}{\partial g^n} = d_c^n p^n (g^n)^(p^n - 1) \exp^{-(g^n)^{p^n}}
\]
#+end_src
Now, looking at $g^n$.
#+begin_src latex
  \[
  \frac{\partial g^n}{\partial \varepsilon_j} =
  \frac{\partial}{\partial \varepsilon_j}
  (\frac{\langle \sqrt{y_{max}^n} - \sqrt{y_0^n} \rangle_+}{\sqrt{y_c^n}})
  \]
#+end_src
In this case, there is again only one term that depends on $\strain$,
$y_{max}^n$. Again the chain rule can be exercised.
#+begin_src latex
  \[
  \frac{\partial g^n}{\partial \varepsilon_j} = 
  \frac{\partial g^n}{\partial y_{max}^n} \frac{\partial y_{max}^n}{\partial \varepsilon_j}
  \]
#+end_src
And the next derivative can be calculated.
#+begin_src latex
  \[
  \frac{\partial g^n}{\partial y_{max}^n} =
  \begin{cases}
    0 & \langle \sqrt{y_{max}^n} - \sqrt{y_0^n} \rangle_+ > 0 \\
    \frac{1}{2 \sqrt{y_{max}^n} \sqrt{y_c^n}} & else
  \end{cases}
  \]
#+end_src
Finally, the end of the chain is near. The driving
forces explicitly depend on $\strain$. Their derivatives are vectorial
are calculated for a given load step $i$ as
#+begin_src latex
  \[
  \frac{\partial y_{max}^n}{\partial \varepsilon_j} =
  \begin{cases}
    0 & y_i^n > y_{max}^n \\
    \frac{\partial y_{max}^n}{\partial \varepsilon_j} & else
  \end{cases}
  \]
#+end_src
Then for each driving force, the final derivative  in Voigt notation is
#+begin_src latex
  \begin{equation}
    \begin{split}
      \frac{\partial y^1}{\partial \strain} &=
      [ C_{11}^0 \varepsilon_{1} 0 0 0 b^2 C_{55}^0 \varepsilon_{5} b^1 C_{66}^0 \varepsilon_{6} ] \\
      \frac{\partial y^2}{\partial \strain} &=
        [ 0 C_{22}^0 \varepsilon_{2} 0 b^2 C_{44}^0 \varepsilon_{4} 0 b^1 C_{66}^0 \varepsilon_{6} ] 
    \end{split}
  \end{equation}
#+end_src
To summarize in broad strokes, the material tangent stiffness tensor
is calculated as follows:
#+begin_src latex
    \begin{equation*}
      \begin{split}
        \frac{\partial \sigma_i}{\partial \varepsilon_j} &=
        \frac{\partial \tilde{C}_{ik}}{\partial \varepsilon_j} \varepsilon_k^{*} + \tilde{C}_{ij} \\
         &= -\tilde{C}_{il} \frac{\partial \tilde{S}_{lm}}{\partial \varepsilon_j} \tilde{C}_{mk} \varepsilon_k^* + \tilde{C}_{ij} \\
         &= -\tilde{C}_{il} (\frac{\partial d^1}{\partial \varepsilon_j} H_{lm}^1 + \frac{\partial d^2}{\partial \varepsilon_j} H_{lm}^2)
        \tilde{C}_{mk} \varepsilon_k^* + \tilde{C}_{ij} \\
      \end{split}
    \end{equation*}
#+end_src
With the quantities
#+begin_src latex
  \begin{equation*}
    \begin{split}
      \frac{\partial d^1}{\partial \varepsilon_j} &=
      \frac{\partial d^1}{\partial g^1} \frac{\partial g^1}{\partial y_{max}^1} \frac{\partial y_{max}^1}{\partial \varepsilon_j} \\
      \frac{\partial d^2}{\partial \varepsilon_j} &=
      \frac{\partial d^2}{\partial g^2} \frac{\partial g^2}{\partial y_{max}^2} \frac{\partial y_{max}^2}{\partial \varepsilon_j} \\
    \end{split}
  \end{equation*}
#+end_src
Of which, all of the required derivatives have been calculated.

