Manuals/OpenDM_2Mode_Theory.org
**** Numerical tangent stiffness matrix

The tangent stiffness matrix can be calculated numerically. This
avoids all of the complicated math shown above, but can add some
computational expense.

If a Taylor series expansion of a stress component is taken at the
current strain,
#+begin_src latex
  \[
  \sigma_i (\strain + \delta \varepsilon_j) = \sigma_i (\strain) +
  \frac{\partial \sigma_i}{\partial \varepsilon_j} (\strain) (\delta \varepsilon_j) + O(\delta \varepsilon_j^2)
  \] 
#+end_src
Where we have abused notation to show that
$\strain + \delta \varepsilon_j$ is the current strain perturbed in
the $j^{th}$ component a magnitude $\delta \varepsilon$.

This Taylor series can be rearranged to get an approximation of the
material tangent stiffness matrix.
#+begin_src latex
  \[
  \vect{C}_{tan} = \frac{\partial \sigma_i}{\partial \varepsilon_j} \approx
  \frac{\sigma_i (\strain + \delta \varepsilon_j) - \sigma_i (\strain)}{\delta \varepsilon_j}
  \]
#+end_src
In practice, for each of the six perturbations of strain a
new vector of stresses are calculated. Those new stresses are
subtracted from the base set of stresses and a column of the tangent
stiffness matrix is obtained.

The numerical tangent stiffness matrix has the same problems with
symmetry as the analytical one. It is also symmetrized to simplify
analysis.

One must also be careful about the value of the strain perturbation. A
smaller value is more accurate, but can lead to numerical troubles.
**** General comments about the tangent stiffness matrix

In numerical studies with the material, we have found the tangent
stiffness matrix to become non-positive definite. In the material
modeling world, this means the material is softening. In other words,
an increase in strain causes a decrease in stress. This has major
applications on the numerical solution. An arclength solver can be
used to capture general behavior. One can also solve strictly
displacement controlled problems to avoid issues.

Also, both the numerical and analytical tangent stiffness tensors are
not generally symmetric. This has significant impacts on the
computational expense of the method. To remedy this, the tangent
matrix is always symmetrized as follows: 
#+begin_src latex
  \[
  \vect{C}_{tan}^{sym} = \frac{1}{2} ( \vect{C}_{tan} + \vect{C}_{tan}^T )
  \]
#+end_src
This symmetrized tangent is no longer analytical, so we are
effectively restricted to quasi-newton solver methods.

* Model Parameters
#+begin_src latex
  \begin{table}[h!]
    \label{tab:OpenDM2Mode_ParamDef}
    \centering
    \begin{tabular}{c|c|c}
      Parameter & Number & Effect \\
      \hline
      $h_i^m$ & $6$ & scales damage mode $m$ effect on compliance from fracture mode $i$ \\
      $b_i$ & $2$ & scales contribution of shear strains to driving forces \\
      $y_0^i$ & $2$ & sets a threshold value of the driving force for mode $m$ \\ 
      $y_c^i$ & $2$ & changes the celerity of the damage progression \\
      $d_c^i$ & $2$ & sets the maximum value of the damage parameter \\
      $p^i$ & $2$ &changes the shape of the curve of damage progression \\
    \end{tabular}
  \end{table}
#+end_src
